Repository: hydrogen-music/hydrogen
Catalog: linux/po/*.po
Languages: de

source: The advanced drum machine
de: Der moderne Schlagzeugcomputer

source: Hydrogen is both a drum sequencer for pattern-based programming and a drum synth. Its simple yet feature-rich design makes it a versatile companion, be it for quick practice at home, professional usage as fully-fledged drum machine in your studio, or drum looper on steriods for your live performance.
de: Hydrogen ist sowohl ein auf Pattern basierter Sequenzer als auch ein Schlagzeug Synthesizer. Sein intuitiver aber zugleich funktionsstrotzender Aufbau macht ihn zum idealen Gefährten für sowohl schnelle Aufnahmen daheim, als auch für den professionellen Einsatz im Heimstudio oder als Schlagzeug Lopper bei Konzerten.

source: Features:
de: Eckdaten:

source: First-class MIDI support
de: Top MIDI Unterstützung

source: Highly customizable
de: Hochgradig individualisierbar

source: Stable and performant
de: Stabil und performant

source: Loads of drumkits to choose from
de: Viele verfügbare Schlagzeugsets

source: In-depth control of instrument, sample, and note properties
de: Detaillierte Kontrolle über die Eigenschaften einzelner Instrument, Audio Samples und Noten

source: High quality time-stretching and pitch shifting
de: Hochwertige Klangdauer- und Tonhöhenanpassung

source: Automate it using MIDI or OSC API
de: Automatisierbar über MIDI oder OSC API

source: This patch release fixes a number of bugs and inconsistencies found since version 1.2.3
de: Korrekturversion, die eine Reihe von Fehler und Ungereimtheiten seit der 1.2.3 behebt.

source: This patch release introduces an AppImage build and fixes a number of bugs and inconsistencies found since version 1.2.2
de: Korrekturversion, die ein AppImage beinhaltet und eine Reihe von Fehler und Ungereimtheiten seit der 1.2.2 behebt.

source: This patch release introduces an AppImage build and fixes a number of bugs and inconsistencies found since version 1.2.1
de: Korrekturversion, die ein AppImage beinhaltet und eine Reihe von Fehler und Ungereimtheiten seit der 1.2.1 behebt.

source: This patch release fixes a number of bugs and inconsistencies found in version 1.2.0
de: Korrekturversion, die eine Reihe Fehler und Ungereimtheiten der 1.2.0 Version behebt

source: New features
de: Neue Funktionen

source: New scalable SVG-based GUI components with more standardized UX
de: Skalierbare, SVG-basierte Benutzeroberfläche mit, deren Verhalten stärker etablierten Standards entspricht

source: Configurable colour themes and adjustable font size to increase accessibility
de: Einstellbares Farbschema und anpassbare Schriftgrößen

source: Pattern and Song editor can follow playback
de: Pattern und Song Editor können der Wiedergabe Position folgen

source: Stacked mode and virtual patterns can show notes from other patterns alongside currently selecte pattern
de: Gestapelter Pattern Modus und virtuelle Pattern zeigen Noten andere aktiver Pattern an

source: Tagging improvements
de: Verbesserte Markierungen im Song Editor

source: New OSC commands
de: Neue OSC Kommandos

source: Builtin crash reporter
de: Eingebauter Absturz Reporter

source: Slightly changed ADSR behaviour to align with natural user expectations
de: Geringfügige Änderungen im ADSR Verhalten, um besser natürlichen Prinzipien zu entsprechen

source: In addition there are many bug fixes, smaller tweaks to behaviour, and many under-the-hood improvements to audio processing structure, timekeeping and performance, as well as GUI speed.
de: Zusätzlich wurden viele Fehler behoben, kleine Verbesserungen im Verhalten sowie größere unter der Haube in der Audioverarbeitung und Effizienz gemacht

source: This is a maintenance release which addresses issues affecting release 1.1.0 and earlier versions of Hydrogen, including
de: Wartungsversion, welche Probleme sowohl der 1.1.0 Version als auch früherer behebt, wie

source: Preferences dialog 'OK' bug
de: Fehler des 'OK' Knopfs in den Einstellungen

source: Audio problems when using LADSPA plugins with PulseAudio
de: Audio Probleme in LADSPA Plug-Ins unter PulseAudio

source: MIDI crashes and other issues on 64-bit Windows
de: MIDI Abstürze und andere Probleme unter 64-bit Windows

source: Missing tags and markers
de: Fehlende Marker

source: Inability to control audio latency on Windows (PortAudio)
de: Fehlende Kontrolle über Latenz unter PortAudio in Windows

source: New features in this release include:
de: Neue Funktionen:

source: Keyboard cursor-driven pattern, song and note properties editing
de: Tastatur-gestütztes Editieren von Pattern, Liedern und Noteneigenschaften

source: Note selection and movement in pattern editors
de: Auswählen und Verschieben von Noten im Pattern Editor

source: New OSC commands (new song, open song, save song (as), quit, toggle looped playback, toggle timeline, toggle Jack transport, toggle Jack timebase master, add/delete timeline marker, toggle song/pattern playback mode)
de: Neue OSC Kommandos

source: NSM support reworked
de: Überarbeitete NSM Unterstützung

source: Deprecating JACK-session
de: Abkündigung von JACK-session

source: Instrument main pitch shift offset
de: Generelle Tonhöhenverschiebung von Instrumenten

source: Custom pattern size support with representation in note values
de: Patternlänge wird als Notenwertverhältnis präsentiert

source: Custom pan law support in mixer
de: Verschiedene Pan Funktionen im Mixer

source: Audio output device selection in CoreAudio (macOS) and PortAudio (Windows)
de: Auswahl des Ausgabegeräts unter CoreAudio (macOS) und PortAudio (Windows)

source: This release primarily addresses issues and bugs discovered by users, rather than adding new features.
de: Diese Version beinhaltet in erster Linie Fehlerbehebungen.

source: User-selectable translation language
de: Benutzerdefinierte Übersetzung

source: Fix critical startup bug on macOS Big Sur
de: Kritischer Startfehler unter macOS Big Sur behoben

source: Fix drumkit export failure on Windows
de: Fehler im Schlagzeugexport unter Windows behoben

source: Fixed compilation with libtar
de: Fehler im Bauen mit libtar behoben

source: Fixed jack transport tempo drift when using non-integer bpm values
de: Abdriften der Wiedergabegeschwindigkeit unter JACK bei Fließkomma Geschwindigkeiten behoben

source: Disabled "development mode" warning
de: "Entwicklungsmodus" Warnung deaktiviert

source: Fix crash on saving ladspa settings
de: Absturz beim Speichern der LADSPA Einstellungen behoben

source: Added manual + tutorial files to Windows and OS X Installers
de: Documentation und Tutorials zu Windows und OS X Installer hinzugefügt

source: It comes with the following new features:
de: Beinhaltet folgende neue Funktionen:

source: QT5 support
de: QT5 Unterstützung

source: OSC support (incl. feedback)
de: OSC Unterstützung (inkl. Feeback)

source: Playback track
de: Playback Spur

source: Menu redesign
de: Menü Überarbeitung

source: Note probability property
de: Wahrscheinlichkeit als Noten Eigenschaft

source: Velocity automation
de: Anschlagsautomatisierung

source: Full screen mode
de: Vollbildmodus

source: New default kit: GMRockKit
de: Neues Standardschlagzeug: GMRockKit

source: It includes the following new features:
de: Neue Funktionen:

source: The color of the SongEditors squares is now configurable
de: Konfigurierbare Farbe für die Kästchen des Song Editors

source: Added support for midi cymbal choking
de: Unterstützung des Stoppens von Becken über MIDI

source: Added support for midi hihat pressure control
de: Unterstützung von Druckkontrolle der Hihat über MIDI

source: Added hihat pressure groups
de: Unterstützung von Druckkontrolle der Hihat

source: Added basic non session manager support
de: Grundlegende NSM Unterstützung

source: Added instrument components
de: Integration von Instrumentkomponenten

source: Basic lilypond export
de: Grundlegender LilyPond Export

source: New windows cross compilation script
de: Neues Skript zum Crosskompilieren auf Windows

source: Support for soundlibrary images
de: Unterstützung von Bildern in Schlagzeugender

source: Configurable sample selection algorithm
de: Konfigurierbarer Algorithmus für die Sampleauswahl

source: Support for soundlibraries with images
de: Unterstützung von Bildern in Schlagzeugender

source: New midi action: SELECT_PREV_PATTERN_RELATIVE
de: Neues MIDI Kommando: SELECT_PREV_PATTERN_RELATIVE

source: Maintenance release. It includes a fixed version numbering for the included debian packaging scripts, a bugfix which supresses the addition of "/" characters in instrument names and two smaller fixes to the pattern handling.
de: Wartungsversion, welches Korrekturen in der Versionierung für die Integration in Debian Paketierungsskripts, sowie Fehlerbehebungen durch zusätzliche "/" Zeichen in Instrumentnamen behebt.

source: new build system (cmake)
de: Neues Buildsystem (cmake)

source: add undo for song/pattern editor
de: Rückgäng machen in Pattern und Song Editor

source: jack-session support
de: Unterstützung von JACK-session

source: jack-midi support
de: JACK-MIDI Unterstützung

source: several bug fixes
de: Einige Fehlerbehebungen

source: tabbed interface
de: Tab Oberfläche

source: several small changes to the GUI
de: Einige kleine Änderungen in der Benutzeroberfläche

source: improve ExportSong add use of TimeLineBPM, RubberbandBatch processor and different types of resample interpolation
de: Verbesserter Liedexport mit Tempomarkierungen der Timeline, einem Rubberband Prozessor und verschiedenen Arten der Interpolation
